'''
Сколько единиц в двоичной записи числа
8**502 – 4**211 + 2**1536 – 19?
'''
print(bin(8 ** 502 - 4 ** 211 + 2 ** 1536 - 19).count('1'))